/**
 * Created by Administrator on 2018/7/2/002.
 * 全局配置文件
 * 王新亮
 */
var JHCYW = {
    //是否加载模型
    isloadSvf: true,
    //是否开启弹窗
    isinfowindow: true,
    viewer_opts: {
        extensions: [
            "Autodesk.Viewing.ZoomWindow"
        ],
        disabledExtensions: {
            measure: false,
            section: false,
        },
        memory: {
            limit: 32 * 1024    //32 GB
        }
    },
    //地面以上的模型  直接输入楼栋序号  地面以下的模型  单个地下模型由两个模型组成：机电模型和 建筑及结构合并模型

    //models_urls:["22号楼","21号楼","19号楼","18号楼","17号楼","15号楼","地下1层","地下2层","地下3层"],
    models_urls:["22号楼","21号楼","19号楼","18号楼","17号楼","15号楼","地下1层","地下2层","地下3层"],
    /*models_urls:["6","7","21","22","17today"],*/
    models_obj:[],
    homePosition: {
        x: -291.0043366824929,
        y: -178.0816380112992,
        z: 94.3020853438724
    },
    huxing:['无','A1-1','A1-1反','A1-2','A1-2反','B1-1','B1-1发','B1-2','B1-2反','B1-3','B1-3反','B2-1','B2-1反','B2-2','B2-2反','B3-1','B3-1反','A1-3','A1-3反',
        'B2-3','B2-3反','B3-3','B3-3反','B4','B4反','A2','A2反','A3','A3反'],
    mianji:[0,27.045,27.045,26.655,26.655,41.091,41.091,41.42,41.42,40.97,40.97,37.314,37.314,37.517,37.517,38.73,38.73,26.81,26.81,
        36.34,36.34,38.13,38.13,38.23,38.23,27.387,27.387,27,27],
    LocationURL:null

};
